In [31]:
import pandas as pd
import numpy as np
import random

import datetime
from datetime import datetime, timedelta
import scipy.stats


import mysql.connector as connector

import warnings
warnings.filterwarnings('ignore')



random.seed(0)
np.random.seed(0)
np.set_printoptions(suppress=True)

### Connecting with my local database (mysql)

In [32]:
mydb = connector.connect( 
  user="user2",
  passwd="sz15r4xx",
  database="littlelemondb",
  auth_plugin='mysql_native_password'  
)

In [33]:
print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001C6BA33B130>

In [34]:
mycursor = mydb.cursor()

In [35]:
mycursor

In [6]:
mydb.reconnect() #Reconnect cursor

### TASK 2
Show all tables

In [14]:
pd.read_sql_query('SHOW tables', mydb)

  Tables_in_littlelemondb
0                 booking
1                customer
2          deliverystatus
3                    menu
4                  orders
5              ordersview
6             ordersview2
7                   staff

In [15]:
pd.read_sql_query("SHOW columns FROM booking", mydb)

       Field         Type Null  Key Default Extra
0  BookingID       b'int'   NO  PRI    None
1       Date  b'datetime'   NO         None
2    TableNO       b'int'   NO         None

In [16]:
pd.read_sql_query("DESCRIBE booking", mydb)

       Field         Type Null  Key Default Extra
0  BookingID       b'int'   NO  PRI    None
1       Date  b'datetime'   NO         None
2    TableNO       b'int'   NO         None

In [17]:
pd.read_sql_query("SELECT * FROM customer", mydb)

Empty DataFrame
Columns: [CustomerID, FullName, ContactNumber, Mail]
Index: []

### TASK 3
For the third and final task, Little Lemon need you to return specific details from your database. They require the full name and contact details for every customer that has placed an order greater than $60 for a promotional campaign.

In [37]:
pd.read_sql_query("""Select customer.FullName, customer.ContactNumber FROM customer
INNER JOIN orders
ON customer.CustomerID = orders.Customer_CustomerID
WHERE orders.TotalCost > 60
""", mydb)

Empty DataFrame
Columns: [FullName, ContactNumber]
Index: []

In [18]:
pd.read_sql_query("SELECT * FROM orders", mydb)

Empty DataFrame
Columns: [OrderID, Date, Quantity, TotalCost, Booking_BookingID, Customer_CustomerID, Menu_MenuID, DeliveryStatus_DeliveryID]
Index: []

In [19]:
pd.read_sql_query("""SELECT customer.FullName, customer.ContactNumber FROM customer
                    INNER JOIN orders
                    ON customer.CustomerID = orders.Customer_CustomerID
                    WHERE orders.TotalCost > 60
                    """, mydb)

Empty DataFrame
Columns: [FullName, ContactNumber]
Index: []

In [21]:
pd.read_sql_query("""CALL GetMaxQuantity();""", mydb)

  MAX(orders.Quantity)
0                 None

In [ ]:
pd.read_sql_query("""CALL CheckBooking("2022-01-01", 5);""", mydb)

In [ ]:
pd.read_sql_query("""CALL AddBooking(99, 99, 99, "2022-12-10");""", mydb)

In [ ]:
mycursor.fetchall()

In [ ]:
pd.read_sql_query("""CALL UpdateBooking(99, "2022-01-10");""", mydb)

In [ ]:
mycursor.fetchall()

In [ ]:
pd.read_sql_query("""CALL CancelBooking(99);""", mydb)

In [ ]:
mycursor.fetchall()